using System.Collections.Frozen;
using System.Numerics;
using Lumina.Excel.Sheets;
using OmenTools.Interop.Game.Lumina;

namespace OmenTools.Info.Game.AetheryteRecord.Data;

public static partial class AetheryteRecords
{
    // 宇宙探索简易以太之光 TerritoryType - Vector3
    internal static readonly FrozenDictionary<uint, List<Vector3>> CosmicExplorationPositions = new Dictionary<uint, List<Vector3>>
    {
        // 憧憬湾
        [1237] = 
        [
            // 月门基地
            new(-1.0f, 1.6f, -28.9f),
            // 葫芦小湾
            new(-541.2f, 59.5f, -530.1f),
            // 婚庆威的实验园
            new(429.1f, 45.5f, 499.8f),
            // 闪亮山
            new(-621.2f, 50.5f, 396.2f),
            // 月底
            new(632.0f, -73.9f, -575.2f),
        ],
        // 法恩娜
        [1291] = 
        [
            // 玻璃匠基地
            new(338.2f, 52.6f, -384.8f),
            // 虹彩阶梯
            new(-154.3f, 29.0f, 313.8f),
            // 玻砾河岸
            new(-643.3f, -1.5f, -630.4f),
            // 胶囊峡谷
            new(675.4f, -242.0f, 425.5f),
            // 熔火涌道
            new(-594.7f, 28.0f, 721.3f),
        ],
        // 俄匊斯
        [1310] = 
        [
            // 大地基地
            new(-165.9f, 0.5f, 78.9f),
            // 升地沙石滩西北
            new(-140.0f, -74.9f, -587.2f),
            // 革剌斯角
            new(-451.4f, 102.1f, 763.0f),
            // 蓝裂幽陆
            new(731.3f, 218.8f, -102.0f),
            // 荒漠地洞遗迹
            new(-121.0f, -193.7f, -796.9f),
        ],
        // 奥克塞西亚
        [1319] = 
        [
            // 原木屋基地
            new(263.4f, 205.7f, 353.6f),
            // 盛放花园
            new(-226.2f, 145.0f, -556.0f),
            // 伞帽凉棚
            new(-244.2f, 168.1f, 317.5f),
            // 树晶堆栈
            new(-599.7f, 206.6f, -371.4f),
            // 苍石林班
            new(-676.6f, 115.0f, 626.7f)
        ],
        
    }.ToFrozenDictionary();
    
    // 天穹街简易以太之光 Index - Vector3
    internal static readonly FrozenDictionary<uint, Vector3> FirmamentPositions = new Dictionary<uint, Vector3>
    {
        // 西升歌文化区
        [0] = new(-92.8f, -0.0f, -116.3f),
        // 东升歌文化区
        [1] = new(111.9f, -20.0f, -107.7f),
        // 十字镐大街
        [2] = new(77.7f, -18.5f, 6.4f),
        // 圣罗埃勒广场
        [3] = new(204.1f, -40.0f, -25.7f),
        // 新巢居住区
        [4] = new(147.1f, -50.0f, 95.7f),
        // 落羽商业区
        [5] = new(-77.9f, 0.0f, 79.6f),
        // 无名众人广场
        [6] = new(20.8f, -16.0f, 168.1f),
        // 白霜官舍
        [7] = new(-135.0f, 10.0f, -11.6f),
        
    }.ToFrozenDictionary();
    
    // 宇宙探索 PlaceName 偏移
    internal static readonly FrozenDictionary<uint, uint> CosmicPlaceNameOffsets = new Dictionary<uint, uint>
    {
        [1237] = 5446, // 憧憬湾
        [1291] = 5456, // 法恩娜
        [1310] = 5451, // 俄匊斯
        [1319] = 5546, // 奥克塞西亚
    }.ToFrozenDictionary();
    
    // 以太之光 / 城内以太之晶 RowID - Vector3
    internal static readonly FrozenDictionary<uint, Vector3> NormalPositions = new Dictionary<uint, Vector3>
    {
        // 格里达尼亚新街
        [2] = new(37.22f, 1.30f, 36.52f),
        // 弯枝牧场
        [3] = new(19.34f, -0.99f, 34.33f),
        // 霍桑山寨
        [4] = new(-195.63f, 3.38f, 292.40f),
        // 石场水车
        [5] = new(186.77f, 9.16f, -72.96f),
        // 恬静路营地
        [6] = new(-224.02f, 21.56f, 348.84f),
        // 秋瓜浮村
        [7] = new(-52.50f, -40.77f, 234.68f),
        // 利姆萨·罗敏萨下层甲板
        [8] = new(-98.15f, 18.70f, 3.51f),
        // 乌尔达哈现世回廊
        [9] = new(-144.20f, -3.19f, -160.56f),
        // 莫拉比造船厂
        [10] = new(167.41f, 14.20f, 670.66f),
        // 太阳海岸
        [11] = new(483.18f, 17.36f, 460.26f),
        // 葡萄酒港
        [12] = new(-11.61f, 70.60f, 9.73f),
        // 雨燕塔殖民地
        [13] = new(659, 9, 509),
        // 小麦酒港
        [14] = new(260, -22.75f, 227),
        // 石绿湖营地
        [15] = new(438, 4.2f, 105f),
        // 瞭望阵营地
        [16] = new(-111.15f, 64.37f, -219.82f),
        // 地平关
        [17] = new(61.36f, 45.10f, -222.16f),
        // 枯骨营地
        [18] = new(-386.31f, -58.90f, 135.49f),
        // 小阿拉米格
        [19] = new(-161.19f, 26.24f, -408.68f),
        // 遗忘绿洲
        [20] = new(-326.85f, 8.36f, 400.22f),
        // 蓝雾营地
        [21] = new(11.82f, 7.08f, 453.58f),
        // 青磷精炼所
        [22] = new(-24.73f, 48.41f, -25.22f),
        // 巨龙首营地
        [23] = new(214.98f, 312.10f, -229.02f),
        // 丧灵钟
        [24] = new(43.70f, 20.60f, -658.71f),
        // 弓箭手行会前
        [25] = new(168.0f, -2.6f, 82.7f),
        // 市场（制革匠行会前）
        [26] = new(102.2f, 8.5f, -108.5f),
        // 枪术师行会前
        [27] = new(117.6f, 11.6f, -230.9f),
        // 幻术师行会前
        [28] = new(-146, 4, -14),
        // 园艺工行会前
        [29] = new(-307.7f, 7.1f, -174.1f),
        // 米凯特露天剧场
        [30] = new(-70.5f, 7, -135.5f),
        // 青貉门（中央林区东侧方面）
        [31] = new(128.9f, 24.7f, -301.8f),
        // 黄蛇门（北部林区方面）
        [32] = new(447.9f, -1.8f, 198.3f),
        // 乌尔达哈冒险者行会前
        [33] = new(66, 4, -118),
        // 咒术师行会前
        [34] = new(-155.32f, 14.11f, 71.12f),
        // 剑术师行会前
        [35] = new(-52, 10, 11),
        // 采矿工行会前
        [36] = new(32, 12, 109),
        // 炼金术士行会前
        [37] = new(-98.96f, 41.10f, 92.26f),
        // 娜娜莫新门（西萨纳兰方面）
        [38] = new(450.5f, 93.9f, 158.1f),
        // 纳尔之门（中萨纳兰北方面）
        [39] = new(-110.9f, 15.7f, 317.7f),
        // 札尔之门（中萨纳兰南方面）
        [40] = new(35.1f, 15.9f, 570.2f),
        // 冒险者行会前（锻铁匠行会/铸甲匠行会/黑涡团）
        [41] = new(18.3f, 40.0f, 70.5f),
        // 烹调师行会前
        [42] = new(-56, 42, -129.5f),
        // 秘术师行会前
        [43] = new(-333, 12, 55),
        // 捕鱼人行会前
        [44] = new(-180.5f, 4, 182.5f),
        // 和风陆门（中拉诺西亚方面）
        [45] = new(-3.1f, 41.9f, 146.5f),
        // 暴风陆门（拉诺西亚低地方面）
        [46] = new(-29.8f, 70.9f, 117.4f),
        // 裁衣匠行会前
        [47] = new(92.88f, 12.10f, 60.58f),
        // 斧术师行会前（珊瑚塔）
        [48] = new(-2.8f, 44.0f, -217.8f),
        // 国际市场前
        [49] = new(-213.5f, 16, 49.5f),
        // 雕金匠行会前
        [50] = new(-20, 14, 75),
        // 乌尔达哈王政厅
        [51] = new(5.73f, 30.10f, -21.77f),
        // 盛夏农庄
        [52] = new(232.60f, 112.96f, -260.52f),
        // 黑尘驿站
        [53] = new(-16.07f, -1.78f, -170.62f),
        // 白狼门（中央林区西侧方面）
        [54] = new(-304.6f, 63.4f, -279.1f),
        // 狼狱停船场
        [55] = new(38.60f, 5.70f, -4.41f),
        // 金碟游乐场
        [62] = new(5.72f, 1.14f, 0.79f),
        // 入口广场（幻卡广场）
        [63] = new(-61.2f, 0.0f, 50.9f),
        // 奇妙广场东区
        [64] = new(57, 21, 64),
        // 奇妙广场西区
        [65] = new(0, 21, 57),
        // 演出广场
        [66] = new(94.6f, -5.0f, -67.4f),
        // 仙人彩
        [67] = new(113, 13, -38),
        // 圆形广场
        [68] = new(-24.4f, 3.3f, -81.4f),
        // 陆行鸟广场
        [69] = new(-11.8f, 0.0f, -35.1f),
        // 伊修加德基础层
        [70] = new(-71.27f, 8.21f, 37.40f),
        // 隼巢
        [71] = new(483.15f, 212.68f, 719.42f),
        // 云顶营地,
        [72] = new(-608, -122.5f, 543),
        // 尊杜集落
        [73] = new(-621.50f, -50.95f, -426.14f),
        // 螺旋港
        [74] = new(-714.20f, -186.86f, -591.05f),
        // 田园郡
        [75] = new(79.78f, 207.64f, -28.42f),
        // 尾羽集落
        [76] = new(535.24f, -51.18f, 40.62f),
        // 不洁三塔
        [77] = new(-295.26f, -21.03f, 33.77f),
        // 莫古力之家
        [78] = new(266.34f, -42.01f, 586.48f),
        // 天极白垩宫
        [79] = new(-577.84f, 49.87f, 316.73f),
        // 忘忧骑士亭前（圣瓦勒鲁瓦扬广场）
        [80] = new(49.4f, 24.0f, -2.5f),
        // 天钢机工房前（圣蕾内特广场）
        [81] = new(-106.3f, 15.1f, -32.7f),
        // 云雾街
        [82] = new(50.9f, -12.0f, 70.2f),
        // 圣冈里奥尔占星院前（伊修加德飞艇坪）
        [83] = new(140.3f, -9.2f, -62.9f),
        // 宝杖大街
        [84] = new(-139, -12.5f, -19),
        // 圣雷马诺大圣堂（圣恩达利姆神学院）
        [85] = new(-84.9f, 10.1f, -121.0f),
        // 神圣裁判所
        [86] = new(79.5f, 10, -122.5f),
        // 终卫要塞（福尔唐伯爵府）
        [87] = new(1.6f, 16.0f, -39.3f),
        // 圣徒门
        [88] = new(-163, 304, -321),
        // 陆行鸟广场（宠物广场）
        [89] = new(51.0f, -0.0f, 26.1f),
        // 田园郡西
        [90] = new(-70, 208.5f, -23.5f),
        // 序言门（龙堡内陆低地西方面）
        [91] = new(-529.4f, 152.8f, -486.0f),
        // 后记门（龙堡内陆低地东方面）
        [92] = new(-219.9f, 104.3f, -600.8f),
        // 利姆萨·罗敏萨飞艇坪
        [93] = new(-11.5f, 91.5f, -12.5f),
        // 格里达尼亚飞艇坪
        [94] = new(24.5f, -19, 97),
        // 乌尔达哈飞艇坪
        [95] = new(-17, 83, -8),
        // 帝国东方堡
        [98] = new(-625, 130, -504),
        // 对等石
        [99] = new(414, 114.3f, 240),
        // 阿拉加纳
        [100] = new(108.55f, 118.16f, -739.30f),
        // 阿拉基利
        [101] = new(-266.02f, 257.87f, 743.39f),
        // 天营门
        [102] = new(-641.97f, 50.00f, -15.28f),
        // 阿拉米格人居住区
        [103] = new(607.16f, 81.00f, 646.32f),
        // 神拳痕
        [104] = new(83.04f, 0.10f, 96.82f),
        // 碧玉水
        [105] = new(360.60f, -119.19f, -271.93f),
        // 自凝岛
        [106] = new(94.58f, 3.03f, -576.47f),
        // 茨菰村
        [107] = new(438.09f, 68.56f, -95.61f),
        // 烈士庵
        [108] = new(250.15f, 4.90f, -395.30f),
        // 重逢集市
        [109] = new(546.14f, -19.51f, 337.31f),
        // 晨曦王座
        [110] = new(74.06f, 114.90f, 25.74f),
        // 黄金港
        [111] = new(41, 4.5f, -40),
        // 潮风亭前
        [112] = new(-76, -5, -80),
        // 第一防波堤
        [113] = new(-113, -5, 151.5f),
        // 拉札罕大使馆前
        [114] = new(36, 8, 147),
        // 小金街
        [115] = new(27, 4, 67),
        // 望海楼
        [116] = new(-77.1f, 18.0f, -166.5f),
        // 乌尔达哈商会馆前
        [117] = new(128, 12, 84),
        // 赤诚组营房南
        [118] = new(120, 12, -88),
        // 乐座街
        [119] = new(26, 6, -148),
        // 红玉海方面
        [120] = new(843.5f, 5.9f, 845.5f),
        // 神拳痕西
        [121] = new(-78, 0.1f, 9),
        // 神拳痕东北
        [122] = new(97, 2, -112.5f),
        // 基拉巴尼亚边区方面
        [123] = new(429.0f, 61.3f, -531.8f),
        // 基拉巴尼亚山区方面
        [124] = new(-644.0f, 50.9f, -788.8f),
        // 乌尔达哈市场
        [125] = new(132, 4, -35),
        // 黄金港飞艇坪
        [126] = new(-55.6f, 79.1f, 44.5f),
        // 多玛飞地
        [127] = new(50.3f, 0.2f, -23.7f),
        // 朵洛衣楼
        [128] = new(-745.06f, 127.92f, 115.91f),
        // 多玛飞地北（无二庭园/农耕地）
        [129] = new(12.4f, -0.0f, -102.5f),
        // 多玛飞地南（栗斋学堂）
        [130] = new(-59.9f, 0.0f, 86.2f),
        // 无二江流域（延夏方面）
        [131] = new(-486.1f, 1.2f, 537.9f),
        // 乔布要塞
        [132] = new(744.98f, 22.70f, -24.90f),
        // 水晶都
        [133] = new(-58.00f, 2.94f, 6.41f),
        // 游末邦
        [134] = new(-1.31f, 82.15f, -10.61f),
        // 废船街东南
        [135] = new(70.1f, -10.4f, 65.2f),
        // 奥斯塔尔严命城
        [136] = new(-724.09f, 51.81f, -227.63f),
        // 滞潮村
        [137] = new(660.93f, 28.22f, 286.76f),
        // 工匠村
        [138] = new(-234.06f, 19.38f, 384.91f),
        // 图姆拉村
        [139] = new(-424.13f, 417.27f, -614.18f),
        // 鼹灵集市
        [140] = new(237.36f, 10.43f, -229.03f),
        // 络尾聚落
        [141] = new(-505.89f, 45.88f, -219.83f),
        // 蛇行枝
        [142] = new(-98.67f, -19.08f, 287.99f),
        // 法诺村
        [143] = new(373.95f, 20.40f, -186.91f),
        // 群花馆
        [144] = new(-334.39f, 48.09f, 508.24f),
        // 普拉恩尼茸洞
        [145] = new(-73.89f, 102.28f, -847.18f),
        // 云村
        [146] = new(371.57f, 86.70f, -690.32f),
        // 鳍人潮池
        [147] = new(549.73f, 349.21f, -199.71f),
        // 马克连萨斯广场
        [148] = new(-156.63f, -281.39f, 223.24f),
        // 宇宙和音市场
        [149] = new(-9, -7.7f, 144.5f),
        // 圣林牧场
        [150] = new(-109.3f, 0.0f, -60.1f),
        // 幔布门前（观星室）
        [151] = new(62.3f, -0.0f, -17.9f),
        // 悬挂公馆前
        [152] = new(34.5f, 0.1f, 217.5f),
        // 阿马罗栈桥前
        [153] = new(67.2f, 36.0f, -133.5f),
        // 中庸工艺馆前
        [154] = new(-51, 20, -170),
        // 博物陈列馆前
        [155] = new(-56.9f, -37.7f, -238.9f),
        // 密铺铁桥（雷克兰德方面）
        [156] = new(826.6f, 36.0f, 407.2f),
        // 承重柱
        [157] = new(12, 36, -5.5f),
        // 腐臭花园
        [158] = new(-56.8f, -0.8f, 51.9f),
        // 光荣门
        [159] = new(5.5f, 5.9f, -60),
        // 光荣路（珂露西亚岛方面）
        [160] = new(174.1f, 56.9f, 851.9f),
        // 上路客店
        [161] = new(396.12f, -28.26f, 298.42f),
        // 码头
        [162] = new(99.4f, -4.2f, 78.9f),
        // 甘戈斯
        [163] = new(-26.82f, -0.50f, -36.69f),
        // 公堂保管院
        [166] = new(444.76f, 169.33f, -471.26f),
        // 小萨雷安
        [167] = new(7.80f, -28.62f, -43.67f),
        // 无路总部
        [168] = new(-724.67f, -28.62f, 301.98f),
        // 新港
        [169] = new(186.73f, 5.90f, 625.49f),
        // 代米尔遗烈乡
        [170] = new(-518.29f, 2.69f, 42.37f),
        // 波洛伽护法村
        [171] = new(398.14f, 3.91f, -243.42f),
        // 碎璃营地
        [172] = new(-402.74f, 22.99f, 474.02f),
        // 第三站
        [173] = new(511.90f, -35.94f, -177.17f),
        // 泪湾
        [174] = new(-552.33f, 132.59f, 640.20f),
        // 最佳威兔洞
        [175] = new(-5.31f, -131.03f, -503.98f),
        // 醒悟天测园
        [176] = new(166.54f, 10.97f, 131.20f),
        // 十二奇园
        [177] = new(-625.10f, -21.29f, 537.43f),
        // 创作者之家
        [178] = new(-532.23f, 159.86f, -212.08f),
        // 半途终旅
        [179] = new(-539.66f, 71.89f, 260.54f),
        // 异亚村落
        [180] = new(55.53f, 269.17f, -650.63f),
        // 奥密克戎基地
        [181] = new(487.32f, 437.10f, 326.23f),
        // 旧萨雷安
        [182] = new(-0.13f, 3.37f, 5.74f),
        // 拉札罕
        [183] = new(36.28f, 0.20f, -25.58f),
        // 萨雷安魔法大学
        [184] = new(-286.7f, 20.0f, -74.9f),
        // 巴尔德西昂分馆前
        [185] = new(-92.0f, 2.6f, 34.9f),
        // 哲学家广场
        [186] = new(-31.5f, 41.3f, -157.5f),
        // 莱韦耶勒尔府前
        [187] = new(210, 21.8f, -121),
        // 漂流的终点
        [188] = new(210.5f, 1.8f, 18.5f),
        // 知识神海港
        [189] = new(20, -16, 130),
        // 诡巧大厅（迷津方面）
        [190] = new(-28.8f, 179.7f, -812.4f),
        // 云使宫前
        [191] = new(-372, 45, -30.5f),
        // 鲁维达纺丝局前
        [192] = new(-160.6f, 36.0f, 27.7f),
        // 拉札罕飞艇坪
        [193] = new(-146.7f, 28.0f, 197.7f),
        // 阿尔扎达尔庙前
        [194] = new(7.8f, -2.0f, 107.4f),
        // 星战士大本营前
        [195] = new(-141, 4, -92.5f),
        // 梅丽德酒房
        [196] = new(-47.4f, -0.0f, -197.2f),
        // 真眼门（萨维奈岛方面）
        [197] = new(520.3f, 55.3f, -624.6f),
        // 卡玛爱区
        [198] = new(135, 27, 16),
        // 炼金术制药堂
        [199] = new(53, -24.7f, -213),
        // 瓦丘恩佩洛
        [200] = new(338.70f, -159.29f, -424.42f),
        // 沃拉的回响
        [201] = new(464.81f, 115.78f, 625.07f),
        // 哈努聚落
        [202] = new(-164.62f, 6.43f, -468.40f),
        // 朋友的灯火
        [203] = new(535.02f, 116.60f, 196.34f),
        // 土陶郡
        [204] = new(-468.06f, 122.74f, 309.88f),
        // 红豹村
        [205] = new(-388.14f, 24.19f, -430.33f),
        // 玛穆克
        [206] = new(713.43f, -132.64f, 519.47f),
        // 胡萨塔伊驿镇
        [207] = new(387.98f, 0.06f, 460.88f),
        // 谢申内青磷泉
        [208] = new(-284.37f, 19.74f, -108.54f),
        // 美花黑泽恩
        [209] = new(303.08f, -13.69f, -561.89f),
        // 亚斯拉尼站
        [210] = new(512.34f, 146.30f, 197.36f),
        // 边郊镇
        [211] = new(-215.15f, 30.30f, -575.72f),
        // 雷转质矿场
        [212] = new(-218.94f, 31.10f, 111.00f),
        // 地场节点·忆
        [213] = new(-1.89f, 53.86f, 785.46f),
        // 地场节点·火
        [214] = new(651.75f, 25.27f, -274.49f),
        // 地场节点·风
        [215] = new(-244.59f, 54.46f, -399.30f),
        // 图莱尤拉
        [216] = new(-32.98f, 0.10f, 11.02f),
        // 九号解决方案
        [217] = new(6.8f, 8.5f, 7f),
        // 气球起降所前
        [218] = new(-419, 3, -48),
        // 翼镜街
        [219] = new(-184.5f, 39.9f, 2.9f),
        // 船头小屋前
        [220] = new(-146.9f, -15.0f, 194.7f),
        // 海岸鸟群市场
        [221] = new(-13.3f, -10.0f, 140.0f),
        // 沃洛克联王宫前
        [222] = new(-94, 100, -220),
        // 珠串万货街
        [223] = new(175, -17, 32),
        // 鲜羽兵站前
        [224] = new(67.3f, 47.0f, -331.0f),
        // 古鲁加加凯旋门（奥阔帕恰山方面）
        [225] = new(650.5f, -120.0f, -444.2f),
        // 古鲁加加凯旋门（克扎玛乌卡湿地方面）
        [226] = new(-283.7f, 13.0f, -814.9f),
        // 生息河岸（克扎玛乌卡湿地方面）
        [227] = new(744.0f, 114.6f, 564.1f),
        // 气球起降所（亚克特尔树海方面）
        [228] = new(18.0f, 8.2f, -666.2f),
        // 萨卡图拉尔关门（夏劳尼荒野方面）
        [229] = new(283.6f, 16.0f, 771.9f),
        // 信息中心前
        [230] = new(-31.3f, -6.1f, 214.0f),
        // 真唯大道
        [231] = new(378, 60, 75),
        // 霓虹酒杯前
        [232] = new(261.8f, 50.8f, 145.5f),
        // 阿卡狄亚协会前
        [233] = new(376.5f, 60, 331),
        // 解答所
        [234] = new(-27, 38, -348),
        // 联合商城
        [235] = new(-156.94f, 0.10f, 20.70f),
        // 居住区域
        [236] = new(-373.9f, 14.0f, 138.7f),
        // 九层检查口（遗产之地方面）
        [237] = new(-293.0f, 45.9f, -831.8f),
        // 水果码头
        [238] = new(780.25f, 13.71f, -232.22f),
        // 幻境村
        [239] = new(43.1f, 0.0f, -2.0f)
    }.ToFrozenDictionary();
}
